package codingtest.self.toss.two;

public class Task5 {
	
	public static void main(String[] args) {

	  	solution();
		
	}//end main()
	
	public static void solution() {
//		튼튼증권에서 실시간 거래량 상위 종목 랭킹을 노출하는 서비스를 준비하고 있습니다.
//		5분 간격으로 랭킹 데이터가 갱신되는 단순한 구조라, 개발자 김튼튼은 서버의 로컬 메모리에 캐싱을 하였습니다.
//
//		그런데 *상장폐지 된 종목 정보가 잘못 랭킹에 섞여 들어가는 사고가 발생했습니다!!
//		랭킹 데이터는 즉시 갱신하였지만, 각 서버의 로컬 메모리에 캐싱된 데이터는 갱신할 수 없어서 즉각적인 대응에 실패하였고,
//		일부 고객님들은 5분간 노출된 상장폐지 된 종목을 클릭하기도 하였습니다.
//
//		고객님들에게 호된 질타를 받은 후, 로컬 캐싱을 거의 동시에 (혹은 수 초 이내에) 갱신하는 방법을 준비하기로 마음 먹었습니다.
//		어떤 방법들을 활용해 볼 수 있을지 작성해 주세요.
//
//		[조건]
//
//		종목 정보는 언제든 수정될 수 있음. (종목 정보 어드민에서 수정)
//		TOP 100 종목과 랭킹은 db 에 적재되어 있음.
//		로컬 캐싱 방법의 제약은 없음, 따라서 자유롭게 구현 가능.
//		도구, 라이브러리 등의 제약 없음.
//		* 상장폐지 : 증권시장에 상장된 종목에 대한 상장 취소. 거래소를 통한 고객 거래가 불가능합니다.
    }//end solution()

}//end class()
