package codingtest.self.toss.two;

public class Task4 {
	
	public static void main(String[] args) {

	  	solution();
		
	}//end main()
	
	public static void solution() {
//		이번에 보험 설계사가 자신을 PR 할 수 있는 '온라인 명함 서비스'를 만들었습니다.
//		'온라인 명함 서비스'는 누구나 링크를 통해서 보험 설계사의 정보를 확인하고 상담신청 할 수 있는 웹서비스 입니다.
//
//		온라인 명함 서비스를 널리 알리기 위해서 온라인 명함 *UV(Unique Visitor) 100회 당 행운상자를 제공하는 이벤트를 만들었습니다.
//		해당 이벤트는 쿠키 기반으로 UV 카운팅하는 로직을 구현했습니다. 서버에서 쿠키를 발급하고 해당 쿠키를 가진 브라우저의 요청은 하루에 한 번만 카운팅 되도록 했습니다.
//
//		그런데 쿠키는 브라우저에서 쉽게 조작할 수 있습니다. 쿠키가 없는 요청은 새 쿠키가 발급되는 것을 이용하여, 조회수를 쉽게 늘리는 어뷰징이 가능한 상황입니다. 이 어뷰징을 막기 위해서 어떤 방법이 있을지 작성해 주세요.
//
//		* UV(Unique Visitor): 측정 기간 동안 중복을 제거한 순방문자 수  / 사용자수, 조회 기간에 방문한 유니크한 사람의 수 
//

    }//end solution()

}//end class()
